# GetNumberOfCircuitRows Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..GetNumberOfCircuitRows Method
PanelScheduleData Class See Also
---
Gets the number of rows in the circuit table
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GetNumberOfCircuitRows()
```

Visual Basic
---
```text
Public Function GetNumberOfCircuitRows As Integer
```

Visual C++
---
```text
public:
int GetNumberOfCircuitRows()
```

# ### Return Value
The number of rows
# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace